---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallJoinRoofFailures.WallNotCoveredByRoof
source: html/4eaa2470-4bbe-0dad-3576-02664498712c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallJoinRoofFailures.WallNotCoveredByRoof Property

The highlighted wall(s) cannot be joined to the highlighted roof because the roof does not entirely cover the wall(s).

## Syntax (C#)
```csharp
public static FailureDefinitionId WallNotCoveredByRoof { get; }
```